## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_manifest.istio-deployment will be created
+   resource "kubernetes_manifest" "istio-deployment" {
+       manifest = {
+           apiVersion = "apps/v1"
+           kind       = "Deployment"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               selector = {
+                   matchLabels = {
+                       app   = "istio-ingressgateway"
+                       istio = "ingressgateway"
                    }
                }
+               template = {
+                   metadata = {
+                       annotations = {
+                           "inject.istio.io/templates" = "gateway"
                        }
+                       labels      = {
+                           app   = "istio-ingressgateway"
+                           istio = "ingressgateway"
                        }
                    }
+                   spec     = {
+                       containers         = [
+                           {
+                               image     = "auto"
+                               name      = "istio-proxy"
+                               resources = {
+                                   limits   = {
+                                       cpu    = "2000m"
+                                       memory = "1024Mi"
                                    }
+                                   requests = {
+                                       cpu    = "100m"
+                                       memory = "128Mi"
                                    }
                                }
                            },
                        ]
+                       serviceAccountName = "istio-ingressgateway"
                    }
                }
            }
        }
+       object   = {
+           apiVersion = "apps/v1"
+           kind       = "Deployment"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               minReadySeconds         = (known after apply)
+               paused                  = (known after apply)
+               progressDeadlineSeconds = (known after apply)
+               replicas                = (known after apply)
+               revisionHistoryLimit    = (known after apply)
+               selector                = {
+                   matchExpressions = (known after apply)
+                   matchLabels      = {
+                       "app"   = "istio-ingressgateway"
+                       "istio" = "ingressgateway"
                    }
                }
+               strategy                = {
+                   rollingUpdate = {
+                       maxSurge       = (known after apply)
+                       maxUnavailable = (known after apply)
                    }
+                   type          = (known after apply)
                }
+               template                = {
+                   metadata = {
+                       annotations                = {
+                           "inject.istio.io/templates" = "gateway"
                        }
+                       clusterName                = (known after apply)
+                       creationTimestamp          = (known after apply)
+                       deletionGracePeriodSeconds = (known after apply)
+                       deletionTimestamp          = (known after apply)
+                       finalizers                 = (known after apply)
+                       generateName               = (known after apply)
+                       generation                 = (known after apply)
+                       labels                     = {
+                           "app"   = "istio-ingressgateway"
+                           "istio" = "ingressgateway"
                        }
+                       managedFields              = (known after apply)
+                       name                       = (known after apply)
+                       namespace                  = (known after apply)
+                       ownerReferences            = (known after apply)
+                       resourceVersion            = (known after apply)
+                       selfLink                   = (known after apply)
+                       uid                        = (known after apply)
                    }
+                   spec     = {
+                       activeDeadlineSeconds         = (known after apply)
+                       affinity                      = {
+                           nodeAffinity    = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = {
+                                   nodeSelectorTerms = (known after apply)
                                }
                            }
+                           podAffinity     = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
+                           podAntiAffinity = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
                        }
+                       automountServiceAccountToken  = (known after apply)
+                       containers                    = [
+                           {
+                               args                     = (known after apply)
+                               command                  = (known after apply)
+                               env                      = (known after apply)
+                               envFrom                  = (known after apply)
+                               image                    = "auto"
+                               imagePullPolicy          = (known after apply)
+                               lifecycle                = {
+                                   postStart = {
+                                       exec      = {
+                                           command = (known after apply)
                                        }
+                                       httpGet   = {
+                                           host        = (known after apply)
+                                           httpHeaders = (known after apply)
+                                           path        = (known after apply)
+                                           port        = (known after apply)
+                                           scheme      = (known after apply)
                                        }
+                                       tcpSocket = {
+                                           host = (known after apply)
+                                           port = (known after apply)
                                        }
                                    }
+                                   preStop   = {
+                                       exec      = {
+                                           command = (known after apply)
                                        }
+                                       httpGet   = {
+                                           host        = (known after apply)
+                                           httpHeaders = (known after apply)
+                                           path        = (known after apply)
+                                           port        = (known after apply)
+                                           scheme      = (known after apply)
                                        }
+                                       tcpSocket = {
+                                           host = (known after apply)
+                                           port = (known after apply)
                                        }
                                    }
                                }
+                               livenessProbe            = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               name                     = "istio-proxy"
+                               ports                    = (known after apply)
+                               readinessProbe           = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               resources                = {
+                                   limits   = {
+                                       "cpu"    = "2000m"
+                                       "memory" = "1024Mi"
                                    }
+                                   requests = {
+                                       "cpu"    = "100m"
+                                       "memory" = "128Mi"
                                    }
                                }
+                               securityContext          = {
+                                   allowPrivilegeEscalation = (known after apply)
+                                   capabilities             = {
+                                       add  = (known after apply)
+                                       drop = (known after apply)
                                    }
+                                   privileged               = (known after apply)
+                                   procMount                = (known after apply)
+                                   readOnlyRootFilesystem   = (known after apply)
+                                   runAsGroup               = (known after apply)
+                                   runAsNonRoot             = (known after apply)
+                                   runAsUser                = (known after apply)
+                                   seLinuxOptions           = {
+                                       level = (known after apply)
+                                       role  = (known after apply)
+                                       type  = (known after apply)
+                                       user  = (known after apply)
                                    }
+                                   seccompProfile           = {
+                                       localhostProfile = (known after apply)
+                                       type             = (known after apply)
                                    }
+                                   windowsOptions           = {
+                                       gmsaCredentialSpec     = (known after apply)
+                                       gmsaCredentialSpecName = (known after apply)
+                                       hostProcess            = (known after apply)
+                                       runAsUserName          = (known after apply)
                                    }
                                }
+                               startupProbe             = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               stdin                    = (known after apply)
+                               stdinOnce                = (known after apply)
+                               terminationMessagePath   = (known after apply)
+                               terminationMessagePolicy = (known after apply)
+                               tty                      = (known after apply)
+                               volumeDevices            = (known after apply)
+                               volumeMounts             = (known after apply)
+                               workingDir               = (known after apply)
                            },
                        ]
+                       dnsConfig                     = {
+                           nameservers = (known after apply)
+                           options     = (known after apply)
+                           searches    = (known after apply)
                        }
+                       dnsPolicy                     = (known after apply)
+                       enableServiceLinks            = (known after apply)
+                       ephemeralContainers           = (known after apply)
+                       hostAliases                   = (known after apply)
+                       hostIPC                       = (known after apply)
+                       hostNetwork                   = (known after apply)
+                       hostPID                       = (known after apply)
+                       hostname                      = (known after apply)
+                       imagePullSecrets              = (known after apply)
+                       initContainers                = (known after apply)
+                       nodeName                      = (known after apply)
+                       nodeSelector                  = (known after apply)
+                       os                            = {
+                           name = (known after apply)
                        }
+                       overhead                      = (known after apply)
+                       preemptionPolicy              = (known after apply)
+                       priority                      = (known after apply)
+                       priorityClassName             = (known after apply)
+                       readinessGates                = (known after apply)
+                       restartPolicy                 = (known after apply)
+                       runtimeClassName              = (known after apply)
+                       schedulerName                 = (known after apply)
+                       securityContext               = {
+                           fsGroup             = (known after apply)
+                           fsGroupChangePolicy = (known after apply)
+                           runAsGroup          = (known after apply)
+                           runAsNonRoot        = (known after apply)
+                           runAsUser           = (known after apply)
+                           seLinuxOptions      = {
+                               level = (known after apply)
+                               role  = (known after apply)
+                               type  = (known after apply)
+                               user  = (known after apply)
                            }
+                           seccompProfile      = {
+                               localhostProfile = (known after apply)
+                               type             = (known after apply)
                            }
+                           supplementalGroups  = (known after apply)
+                           sysctls             = (known after apply)
+                           windowsOptions      = {
+                               gmsaCredentialSpec     = (known after apply)
+                               gmsaCredentialSpecName = (known after apply)
+                               hostProcess            = (known after apply)
+                               runAsUserName          = (known after apply)
                            }
                        }
+                       serviceAccount                = (known after apply)
+                       serviceAccountName            = "istio-ingressgateway"
+                       setHostnameAsFQDN             = (known after apply)
+                       shareProcessNamespace         = (known after apply)
+                       subdomain                     = (known after apply)
+                       terminationGracePeriodSeconds = (known after apply)
+                       tolerations                   = (known after apply)
+                       topologySpreadConstraints     = (known after apply)
+                       volumes                       = (known after apply)
                    }
                }
            }
        }
    }

  # kubernetes_manifest.istio-hpa will be created
+   resource "kubernetes_manifest" "istio-hpa" {
+       manifest = {
+           apiVersion = "autoscaling/v2beta1"
+           kind       = "HorizontalPodAutoscaler"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               maxReplicas    = 5
+               metrics        = [
+                   {
+                       resource = {
+                           name                     = "cpu"
+                           targetAverageUtilization = 80
                        }
+                       type     = "Resource"
                    },
                ]
+               minReplicas    = 2
+               scaleTargetRef = {
+                   apiVersion = "apps/v1"
+                   kind       = "Deployment"
+                   name       = "istio-ingressgateway"
                }
            }
        }
+       object   = {
+           apiVersion = "autoscaling/v2beta1"
+           kind       = "HorizontalPodAutoscaler"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               maxReplicas    = 5
+               metrics        = [
+                   {
+                       containerResource = {
+                           container                = (known after apply)
+                           name                     = (known after apply)
+                           targetAverageUtilization = (known after apply)
+                           targetAverageValue       = (known after apply)
                        }
+                       external          = {
+                           metricName         = (known after apply)
+                           metricSelector     = {
+                               matchExpressions = (known after apply)
+                               matchLabels      = (known after apply)
                            }
+                           targetAverageValue = (known after apply)
+                           targetValue        = (known after apply)
                        }
+                       object            = {
+                           averageValue = (known after apply)
+                           metricName   = (known after apply)
+                           selector     = {
+                               matchExpressions = (known after apply)
+                               matchLabels      = (known after apply)
                            }
+                           target       = {
+                               apiVersion = (known after apply)
+                               kind       = (known after apply)
+                               name       = (known after apply)
                            }
+                           targetValue  = (known after apply)
                        }
+                       pods              = {
+                           metricName         = (known after apply)
+                           selector           = {
+                               matchExpressions = (known after apply)
+                               matchLabels      = (known after apply)
                            }
+                           targetAverageValue = (known after apply)
                        }
+                       resource          = {
+                           name                     = "cpu"
+                           targetAverageUtilization = 80
+                           targetAverageValue       = (known after apply)
                        }
+                       type              = "Resource"
                    },
                ]
+               minReplicas    = 2
+               scaleTargetRef = {
+                   apiVersion = "apps/v1"
+                   kind       = "Deployment"
+                   name       = "istio-ingressgateway"
                }
            }
        }
    }

  # kubernetes_manifest.istio-pdb will be created
+   resource "kubernetes_manifest" "istio-pdb" {
+       manifest = {
+           apiVersion = "policy/v1beta1"
+           kind       = "PodDisruptionBudget"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               minAvailable = 1
+               selector     = {
+                   matchLabels = {
+                       app   = "istio-ingressgateway"
+                       istio = "ingressgateway"
                    }
                }
            }
        }
+       object   = {
+           apiVersion = "policy/v1beta1"
+           kind       = "PodDisruptionBudget"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               maxUnavailable = (known after apply)
+               minAvailable   = "1"
+               selector       = {
+                   matchExpressions = (known after apply)
+                   matchLabels      = {
+                       "app"   = "istio-ingressgateway"
+                       "istio" = "ingressgateway"
                    }
                }
            }
        }
    }

  # kubernetes_manifest.istio-rbac-role will be created
+   resource "kubernetes_manifest" "istio-rbac-role" {
+       manifest = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "Role"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           rules      = [
+               {
+                   apiGroups = [
+                       "",
                    ]
+                   resources = [
+                       "secrets",
                    ]
+                   verbs     = [
+                       "get",
+                       "watch",
+                       "list",
                    ]
                },
            ]
        }
+       object   = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "Role"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           rules      = [
+               {
+                   apiGroups       = [
+                       "",
                    ]
+                   nonResourceURLs = (known after apply)
+                   resourceNames   = (known after apply)
+                   resources       = [
+                       "secrets",
                    ]
+                   verbs           = [
+                       "get",
+                       "watch",
+                       "list",
                    ]
                },
            ]
        }
    }

  # kubernetes_manifest.istio-rbac-rolebinding will be created
+   resource "kubernetes_manifest" "istio-rbac-rolebinding" {
+       manifest = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "RoleBinding"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           roleRef    = {
+               apiGroup = "rbac.authorization.k8s.io"
+               kind     = "Role"
+               name     = "istio-ingressgateway-sds"
            }
+           subjects   = [
+               {
+                   kind = "ServiceAccount"
+                   name = "istio-ingressgateway-service-account"
                },
            ]
        }
+       object   = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "RoleBinding"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           roleRef    = {
+               apiGroup = "rbac.authorization.k8s.io"
+               kind     = "Role"
+               name     = "istio-ingressgateway-sds"
            }
+           subjects   = [
+               {
+                   apiGroup  = (known after apply)
+                   kind      = "ServiceAccount"
+                   name      = "istio-ingressgateway-service-account"
+                   namespace = (known after apply)
                },
            ]
        }
    }

  # kubernetes_manifest.istio-service will be created
+   resource "kubernetes_manifest" "istio-service" {
+       manifest = {
+           apiVersion = "v1"
+           kind       = "Service"
+           metadata   = {
+               labels    = {
+                   app   = "istio-ingressgateway"
+                   istio = "ingressgateway"
                }
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               ports    = [
+                   {
+                       name       = "status-port"
+                       port       = 15021
+                       protocol   = "TCP"
+                       targetPort = 15021
                    },
+                   {
+                       name = "http2"
+                       port = 80
                    },
+                   {
+                       name = "https"
+                       port = 443
                    },
                ]
+               selector = {
+                   app   = "istio-ingressgateway"
+                   istio = "ingressgateway"
                }
+               type     = "LoadBalancer"
            }
        }
+       object   = {
+           apiVersion = "v1"
+           kind       = "Service"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               allocateLoadBalancerNodePorts = (known after apply)
+               clusterIP                     = (known after apply)
+               clusterIPs                    = (known after apply)
+               externalIPs                   = (known after apply)
+               externalName                  = (known after apply)
+               externalTrafficPolicy         = (known after apply)
+               healthCheckNodePort           = (known after apply)
+               internalTrafficPolicy         = (known after apply)
+               ipFamilies                    = (known after apply)
+               ipFamilyPolicy                = (known after apply)
+               loadBalancerClass             = (known after apply)
+               loadBalancerIP                = (known after apply)
+               loadBalancerSourceRanges      = (known after apply)
+               ports                         = [
+                   {
+                       appProtocol = (known after apply)
+                       name        = "status-port"
+                       nodePort    = (known after apply)
+                       port        = 15021
+                       protocol    = "TCP"
+                       targetPort  = "15021"
                    },
+                   {
+                       appProtocol = (known after apply)
+                       name        = "http2"
+                       nodePort    = (known after apply)
+                       port        = 80
+                       protocol    = (known after apply)
+                       targetPort  = (known after apply)
                    },
+                   {
+                       appProtocol = (known after apply)
+                       name        = "https"
+                       nodePort    = (known after apply)
+                       port        = 443
+                       protocol    = (known after apply)
+                       targetPort  = (known after apply)
                    },
                ]
+               publishNotReadyAddresses      = (known after apply)
+               selector                      = {
+                   "app"   = "istio-ingressgateway"
+                   "istio" = "ingressgateway"
                }
+               sessionAffinity               = (known after apply)
+               sessionAffinityConfig         = {
+                   clientIP = {
+                       timeoutSeconds = (known after apply)
                    }
                }
+               type                          = "LoadBalancer"
            }
        }
    }

  # kubernetes_manifest.istio-serviceaccount will be created
+   resource "kubernetes_manifest" "istio-serviceaccount" {
+       manifest = {
+           apiVersion = "v1"
+           kind       = "ServiceAccount"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
        }
+       object   = {
+           apiVersion                   = "v1"
+           automountServiceAccountToken = (known after apply)
+           imagePullSecrets             = (known after apply)
+           kind                         = "ServiceAccount"
+           metadata                     = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           secrets                      = (known after apply)
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

Plan: 7 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
